//Шахов Д.В.{

//Найти клиента
&НаСервере
Процедура НайтиНаСервере()
	Клиент = Справочники.Клиенты.НайтиПоРеквизиту("Телефон",ЭтаФорма.НомерТелефона);
	ЭтаФорма.Пользователь = Клиент;
КонецПроцедуры
&НаКлиенте
Процедура НайтиКлиента(Команда)
	НайтиНаСервере();
	Если ЗначениеЗаполнено(Пользователь) Тогда
		Сообщить("Здравствуйте, " + Пользователь + "! Вы успешно авторизовались.");
		Элементы.Продолжить.Видимость = Истина;
		Элементы.ЛичныйКабинет.Видимость = Истина;
	Иначе
		Сообщить("Не удалось вас найти, проверьте введенный номер телефона или зарегистрируйтесь!");
	КонецЕсли;
КонецПроцедуры

//Продолжить
&НаКлиенте
Процедура ПродолжитьЗаказ(Команда)
	Если ЗначениеЗаполнено(Пользователь) Тогда
		ПараметрыФормы = Новый Структура("Пользователь", Пользователь);
		ОткрытьФорму("Обработка.ВыборТоваровКлиентом.Форма.Форма", ПараметрыФормы);
		ЭтаФорма.Закрыть();
	Иначе
		Сообщить("Чтобы продолжить, необходимо авторизоваться!");
	КонецЕсли;
	
КонецПроцедуры

//Создать нового пользователя
&НаСервере
Функция СоздатьНовогоПользователяНаСервере()
	НовыйПользователь = Справочники.Клиенты.СоздатьЭлемент();
	Возврат НовыйПользователь.Ссылка;
КонецФункции
&НаКлиенте
Процедура СоздатьНовогоПользователя(Команда)
	ПараметрыФормы = Новый Структура("РегистрируетсяНовыйКлиент", Истина);
	ПараметрыФормы.Вставить("НомерТелефона", ЭтаФорма.НомерТелефона);
	ОткрытьФорму("Справочник.Клиенты.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

//Очистить
&НаСервере
Процедура СтеретьНаСервере()
	ЭтаФорма.Пользователь = Справочники.Клиенты.ПустаяСсылка();
	ЭтаФорма.НомерТелефона = "";
	Элементы.Продолжить.Видимость = Ложь;
	Элементы.ЛичныйКабинет.Видимость = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура Стереть(Команда)
	СтеретьНаСервере();
КонецПроцедуры

//ЛичныйКабинет
&НаКлиенте
Процедура ЛичныйКабинет(Команда)
	 Если ЗначениеЗаполнено(Пользователь) Тогда
		ПараметрыФормы = Новый Структура("Пользователь", Пользователь);
		ОткрытьФорму("Обработка.ЛичныйКабинетКлиента.Форма.Форма", ПараметрыФормы);
		ЭтаФорма.Закрыть();
	Иначе
		Сообщить("Чтобы продолжить, необходимо авторизоваться!");
	КонецЕсли;
КонецПроцедуры


// } Шахов Д.В.